Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.1/include/pio/pic32cx1025sg60100.h
#define PIN_PA10B_ADC0_Y8                          _UL_(10)    
#define MUX_PA10B_ADC0_Y8                          _UL_(1)     
#define PINMUX_PA10B_ADC0_Y8                       ((PIN_PA10B_ADC0_Y8 << 16) | MUX_PA10B_ADC0_Y8)
#define PORT_PA10B_ADC0_Y8                         (_UL_(1) << 10)

#define PIN_PA11B_ADC0_Y9                          _UL_(11)    
#define MUX_PA11B_ADC0_Y9                          _UL_(1)     
#define PINMUX_PA11B_ADC0_Y9                       ((PIN_PA11B_ADC0_Y9 << 16) | MUX_PA11B_ADC0_Y9)
#define PORT_PA11B_ADC0_Y9                         (_UL_(1) << 11)

#define PIN_PA16B_ADC0_Y10                         _UL_(16)    
#define MUX_PA16B_ADC0_Y10                         _UL_(1)     
#define PINMUX_PA16B_ADC0_Y10                      ((PIN_PA16B_ADC0_Y10 << 16) | MUX_PA16B_ADC0_Y10)
#define PORT_PA16B_ADC0_Y10                        (_UL_(1) << 16)

#define PIN_PA17B_ADC0_Y11                         _UL_(17)    
#define MUX_PA17B_ADC0_Y11                         _UL_(1)     
#define PINMUX_PA17B_ADC0_Y11                      ((PIN_PA17B_ADC0_Y11 << 16) | MUX_PA17B_ADC0_Y11)
#define PORT_PA17B_ADC0_Y11                        (_UL_(1) << 17)

#define PIN_PA18B_ADC0_Y12                         _UL_(18)    
#define MUX_PA18B_ADC0_Y12                         _UL_(1)     
#define PINMUX_PA18B_ADC0_Y12                      ((PIN_PA18B_ADC0_Y12 << 16) | MUX_PA18B_ADC0_Y12)
#define PORT_PA18B_ADC0_Y12                        (_UL_(1) << 18)

#define PIN_PA19B_ADC0_Y13                         _UL_(19)    
#define MUX_PA19B_ADC0_Y13                         _UL_(1)     
#define PINMUX_PA19B_ADC0_Y13                      ((PIN_PA19B_ADC0_Y13 << 16) | MUX_PA19B_ADC0_Y13)
#define PORT_PA19B_ADC0_Y13                        (_UL_(1) << 19)

#define PIN_PA20B_ADC0_Y14                         _UL_(20)    
#define MUX_PA20B_ADC0_Y14                         _UL_(1)     
#define PINMUX_PA20B_ADC0_Y14                      ((PIN_PA20B_ADC0_Y14 << 16) | MUX_PA20B_ADC0_Y14)
#define PORT_PA20B_ADC0_Y14                        (_UL_(1) << 20)

#define PIN_PA21B_ADC0_Y15                         _UL_(21)    
#define MUX_PA21B_ADC0_Y15                         _UL_(1)     
#define PINMUX_PA21B_ADC0_Y15                      ((PIN_PA21B_ADC0_Y15 << 16) | MUX_PA21B_ADC0_Y15)
#define PORT_PA21B_ADC0_Y15                        (_UL_(1) << 21)

#define PIN_PA22B_ADC0_Y16                         _UL_(22)    
#define MUX_PA22B_ADC0_Y16                         _UL_(1)     
#define PINMUX_PA22B_ADC0_Y16                      ((PIN_PA22B_ADC0_Y16 << 16) | MUX_PA22B_ADC0_Y16)
#define PORT_PA22B_ADC0_Y16                        (_UL_(1) << 22)

#define PIN_PA23B_ADC0_Y17                         _UL_(23)    
#define MUX_PA23B_ADC0_Y17                         _UL_(1)     
#define PINMUX_PA23B_ADC0_Y17                      ((PIN_PA23B_ADC0_Y17 << 16) | MUX_PA23B_ADC0_Y17)
#define PORT_PA23B_ADC0_Y17                        (_UL_(1) << 23)

#define PIN_PA27B_ADC0_Y18                         _UL_(27)    
#define MUX_PA27B_ADC0_Y18                         _UL_(1)     
#define PINMUX_PA27B_ADC0_Y18                      ((PIN_PA27B_ADC0_Y18 << 16) | MUX_PA27B_ADC0_Y18)
#define PORT_PA27B_ADC0_Y18                        (_UL_(1) << 27)

#define PIN_PA30B_ADC0_Y19                         _UL_(30)    
#define MUX_PA30B_ADC0_Y19                         _UL_(1)     
#define PINMUX_PA30B_ADC0_Y19                      ((PIN_PA30B_ADC0_Y19 << 16) | MUX_PA30B_ADC0_Y19)
#define PORT_PA30B_ADC0_Y19                        (_UL_(1) << 30)

#define PIN_PB02B_ADC0_Y20                         _UL_(34)    
#define MUX_PB02B_ADC0_Y20                         _UL_(1)     
#define PINMUX_PB02B_ADC0_Y20                      ((PIN_PB02B_ADC0_Y20 << 16) | MUX_PB02B_ADC0_Y20)
#define PORT_PB02B_ADC0_Y20                        (_UL_(1) << 2)

#define PIN_PB03B_ADC0_Y21                         _UL_(35)    
#define MUX_PB03B_ADC0_Y21                         _UL_(1)     
#define PINMUX_PB03B_ADC0_Y21                      ((PIN_PB03B_ADC0_Y21 << 16) | MUX_PB03B_ADC0_Y21)
#define PORT_PB03B_ADC0_Y21                        (_UL_(1) << 3)

#define PIN_PB04B_ADC0_Y22                         _UL_(36)    
#define MUX_PB04B_ADC0_Y22                         _UL_(1)     
#define PINMUX_PB04B_ADC0_Y22                      ((PIN_PB04B_ADC0_Y22 << 16) | MUX_PB04B_ADC0_Y22)
#define PORT_PB04B_ADC0_Y22                        (_UL_(1) << 4)

#define PIN_PB05B_ADC0_Y23                         _UL_(37)    
#define MUX_PB05B_ADC0_Y23                         _UL_(1)     
#define PINMUX_PB05B_ADC0_Y23                      ((PIN_PB05B_ADC0_Y23 << 16) | MUX_PB05B_ADC0_Y23)
#define PORT_PB05B_ADC0_Y23                        (_UL_(1) << 5)

#define PIN_PB06B_ADC0_Y24                         _UL_(38)    
#define MUX_PB06B_ADC0_Y24                         _UL_(1)     
#define PINMUX_PB06B_ADC0_Y24                      ((PIN_PB06B_ADC0_Y24 << 16) | MUX_PB06B_ADC0_Y24)
#define PORT_PB06B_ADC0_Y24                        (_UL_(1) << 6)

#define PIN_PB07B_ADC0_Y25                         _UL_(39)    
#define MUX_PB07B_ADC0_Y25                         _UL_(1)     
#define PINMUX_PB07B_ADC0_Y25                      ((PIN_PB07B_ADC0_Y25 << 16) | MUX_PB07B_ADC0_Y25)
#define PORT_PB07B_ADC0_Y25                        (_UL_(1) << 7)

#define PIN_PB12B_ADC0_Y26                         _UL_(44)    
#define MUX_PB12B_ADC0_Y26                         _UL_(1)     
#define PINMUX_PB12B_ADC0_Y26                      ((PIN_PB12B_ADC0_Y26 << 16) | MUX_PB12B_ADC0_Y26)
#define PORT_PB12B_ADC0_Y26                        (_UL_(1) << 12)

#define PIN_PB13B_ADC0_Y27                         _UL_(45)    
#define MUX_PB13B_ADC0_Y27                         _UL_(1)     
#define PINMUX_PB13B_ADC0_Y27                      ((PIN_PB13B_ADC0_Y27 << 16) | MUX_PB13B_ADC0_Y27)
#define PORT_PB13B_ADC0_Y27                        (_UL_(1) << 13)

#define PIN_PB14B_ADC0_Y28                         _UL_(46)    
#define MUX_PB14B_ADC0_Y28                         _UL_(1)     
#define PINMUX_PB14B_ADC0_Y28                      ((PIN_PB14B_ADC0_Y28 << 16) | MUX_PB14B_ADC0_Y28)
#define PORT_PB14B_ADC0_Y28                        (_UL_(1) << 14)

#define PIN_PB15B_ADC0_Y29                         _UL_(47)    
#define MUX_PB15B_ADC0_Y29                         _UL_(1)     
#define PINMUX_PB15B_ADC0_Y29                      ((PIN_PB15B_ADC0_Y29 << 16) | MUX_PB15B_ADC0_Y29)
#define PORT_PB15B_ADC0_Y29                        (_UL_(1) << 15)

#define PIN_PB00B_ADC0_Y30                         _UL_(32)    
#define MUX_PB00B_ADC0_Y30                         _UL_(1)     
#define PINMUX_PB00B_ADC0_Y30                      ((PIN_PB00B_ADC0_Y30 << 16) | MUX_PB00B_ADC0_Y30)
#define PORT_PB00B_ADC0_Y30                        (_UL_(1) << 0)

#define PIN_PB01B_ADC0_Y31                         _UL_(33)    
#define MUX_PB01B_ADC0_Y31                         _UL_(1)     
#define PINMUX_PB01B_ADC0_Y31                      ((PIN_PB01B_ADC0_Y31 << 16) | MUX_PB01B_ADC0_Y31)
#define PORT_PB01B_ADC0_Y31                        (_UL_(1) << 1)

/* ========== PORT definition for ADC1 peripheral ========== */
#define PIN_PB08B_ADC1_AIN0                        _UL_(40)    
#define MUX_PB08B_ADC1_AIN0                        _UL_(1)     
#define PINMUX_PB08B_ADC1_AIN0                     ((PIN_PB08B_ADC1_AIN0 << 16) | MUX_PB08B_ADC1_AIN0)
#define PORT_PB08B_ADC1_AIN0                       (_UL_(1) << 8)

#define PIN_PB09B_ADC1_AIN1                        _UL_(41)    
#define MUX_PB09B_ADC1_AIN1                        _UL_(1)     
#define PINMUX_PB09B_ADC1_AIN1                     ((PIN_PB09B_ADC1_AIN1 << 16) | MUX_PB09B_ADC1_AIN1)
#define PORT_PB09B_ADC1_AIN1                       (_UL_(1) << 9)

