Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.1/include/pio/pic32cx1025sg60100.h
#define PIN_PA10M_GCLK_IO4                         _UL_(10)    
#define MUX_PA10M_GCLK_IO4                         _UL_(12)    
#define PINMUX_PA10M_GCLK_IO4                      ((PIN_PA10M_GCLK_IO4 << 16) | MUX_PA10M_GCLK_IO4)
#define PORT_PA10M_GCLK_IO4                        (_UL_(1) << 10)

#define PIN_PB10M_GCLK_IO4                         _UL_(42)    
#define MUX_PB10M_GCLK_IO4                         _UL_(12)    
#define PINMUX_PB10M_GCLK_IO4                      ((PIN_PB10M_GCLK_IO4 << 16) | MUX_PB10M_GCLK_IO4)
#define PORT_PB10M_GCLK_IO4                        (_UL_(1) << 10)

#define PIN_PB18M_GCLK_IO4                         _UL_(50)    
#define MUX_PB18M_GCLK_IO4                         _UL_(12)    
#define PINMUX_PB18M_GCLK_IO4                      ((PIN_PB18M_GCLK_IO4 << 16) | MUX_PB18M_GCLK_IO4)
#define PORT_PB18M_GCLK_IO4                        (_UL_(1) << 18)

#define PIN_PA11M_GCLK_IO5                         _UL_(11)    
#define MUX_PA11M_GCLK_IO5                         _UL_(12)    
#define PINMUX_PA11M_GCLK_IO5                      ((PIN_PA11M_GCLK_IO5 << 16) | MUX_PA11M_GCLK_IO5)
#define PORT_PA11M_GCLK_IO5                        (_UL_(1) << 11)

#define PIN_PB11M_GCLK_IO5                         _UL_(43)    
#define MUX_PB11M_GCLK_IO5                         _UL_(12)    
#define PINMUX_PB11M_GCLK_IO5                      ((PIN_PB11M_GCLK_IO5 << 16) | MUX_PB11M_GCLK_IO5)
#define PORT_PB11M_GCLK_IO5                        (_UL_(1) << 11)

#define PIN_PB19M_GCLK_IO5                         _UL_(51)    
#define MUX_PB19M_GCLK_IO5                         _UL_(12)    
#define PINMUX_PB19M_GCLK_IO5                      ((PIN_PB19M_GCLK_IO5 << 16) | MUX_PB19M_GCLK_IO5)
#define PORT_PB19M_GCLK_IO5                        (_UL_(1) << 19)

#define PIN_PB12M_GCLK_IO6                         _UL_(44)    
#define MUX_PB12M_GCLK_IO6                         _UL_(12)    
#define PINMUX_PB12M_GCLK_IO6                      ((PIN_PB12M_GCLK_IO6 << 16) | MUX_PB12M_GCLK_IO6)
#define PORT_PB12M_GCLK_IO6                        (_UL_(1) << 12)

#define PIN_PB20M_GCLK_IO6                         _UL_(52)    
#define MUX_PB20M_GCLK_IO6                         _UL_(12)    
#define PINMUX_PB20M_GCLK_IO6                      ((PIN_PB20M_GCLK_IO6 << 16) | MUX_PB20M_GCLK_IO6)
#define PORT_PB20M_GCLK_IO6                        (_UL_(1) << 20)

#define PIN_PB13M_GCLK_IO7                         _UL_(45)    
#define MUX_PB13M_GCLK_IO7                         _UL_(12)    
#define PINMUX_PB13M_GCLK_IO7                      ((PIN_PB13M_GCLK_IO7 << 16) | MUX_PB13M_GCLK_IO7)
#define PORT_PB13M_GCLK_IO7                        (_UL_(1) << 13)

#define PIN_PB21M_GCLK_IO7                         _UL_(53)    
#define MUX_PB21M_GCLK_IO7                         _UL_(12)    
#define PINMUX_PB21M_GCLK_IO7                      ((PIN_PB21M_GCLK_IO7 << 16) | MUX_PB21M_GCLK_IO7)
#define PORT_PB21M_GCLK_IO7                        (_UL_(1) << 21)

/* ========== PORT definition for GMAC peripheral ========== */
#define PIN_PC21L_GMAC_GCOL                        _UL_(85)    
#define MUX_PC21L_GMAC_GCOL                        _UL_(11)    
#define PINMUX_PC21L_GMAC_GCOL                     ((PIN_PC21L_GMAC_GCOL << 16) | MUX_PC21L_GMAC_GCOL)
#define PORT_PC21L_GMAC_GCOL                       (_UL_(1) << 21)

#define PIN_PA16L_GMAC_GCRS                        _UL_(16)    
#define MUX_PA16L_GMAC_GCRS                        _UL_(11)    
#define PINMUX_PA16L_GMAC_GCRS                     ((PIN_PA16L_GMAC_GCRS << 16) | MUX_PA16L_GMAC_GCRS)
#define PORT_PA16L_GMAC_GCRS                       (_UL_(1) << 16)

#define PIN_PA20L_GMAC_GMDC                        _UL_(20)    
#define MUX_PA20L_GMAC_GMDC                        _UL_(11)    
#define PINMUX_PA20L_GMAC_GMDC                     ((PIN_PA20L_GMAC_GMDC << 16) | MUX_PA20L_GMAC_GMDC)
#define PORT_PA20L_GMAC_GMDC                       (_UL_(1) << 20)

#define PIN_PB14L_GMAC_GMDC                        _UL_(46)    
#define MUX_PB14L_GMAC_GMDC                        _UL_(11)    
#define PINMUX_PB14L_GMAC_GMDC                     ((PIN_PB14L_GMAC_GMDC << 16) | MUX_PB14L_GMAC_GMDC)
#define PORT_PB14L_GMAC_GMDC                       (_UL_(1) << 14)

#define PIN_PC11L_GMAC_GMDC                        _UL_(75)    
#define MUX_PC11L_GMAC_GMDC                        _UL_(11)    
#define PINMUX_PC11L_GMAC_GMDC                     ((PIN_PC11L_GMAC_GMDC << 16) | MUX_PC11L_GMAC_GMDC)
#define PORT_PC11L_GMAC_GMDC                       (_UL_(1) << 11)

#define PIN_PA21L_GMAC_GMDIO                       _UL_(21)    
#define MUX_PA21L_GMAC_GMDIO                       _UL_(11)    
#define PINMUX_PA21L_GMAC_GMDIO                    ((PIN_PA21L_GMAC_GMDIO << 16) | MUX_PA21L_GMAC_GMDIO)
#define PORT_PA21L_GMAC_GMDIO                      (_UL_(1) << 21)

#define PIN_PB15L_GMAC_GMDIO                       _UL_(47)    
#define MUX_PB15L_GMAC_GMDIO                       _UL_(11)    
#define PINMUX_PB15L_GMAC_GMDIO                    ((PIN_PB15L_GMAC_GMDIO << 16) | MUX_PB15L_GMAC_GMDIO)
#define PORT_PB15L_GMAC_GMDIO                      (_UL_(1) << 15)

#define PIN_PC12L_GMAC_GMDIO                       _UL_(76)    
#define MUX_PC12L_GMAC_GMDIO                       _UL_(11)    
#define PINMUX_PC12L_GMAC_GMDIO                    ((PIN_PC12L_GMAC_GMDIO << 16) | MUX_PC12L_GMAC_GMDIO)
#define PORT_PC12L_GMAC_GMDIO                      (_UL_(1) << 12)

#define PIN_PA13L_GMAC_GRX0                        _UL_(13)    
#define MUX_PA13L_GMAC_GRX0                        _UL_(11)    
#define PINMUX_PA13L_GMAC_GRX0                     ((PIN_PA13L_GMAC_GRX0 << 16) | MUX_PA13L_GMAC_GRX0)
#define PORT_PA13L_GMAC_GRX0                       (_UL_(1) << 13)

#define PIN_PA12L_GMAC_GRX1                        _UL_(12)    
#define MUX_PA12L_GMAC_GRX1                        _UL_(11)    
#define PINMUX_PA12L_GMAC_GRX1                     ((PIN_PA12L_GMAC_GRX1 << 16) | MUX_PA12L_GMAC_GRX1)
#define PORT_PA12L_GMAC_GRX1                       (_UL_(1) << 12)

#define PIN_PC15L_GMAC_GRX2                        _UL_(79)    
#define MUX_PC15L_GMAC_GRX2                        _UL_(11)    
#define PINMUX_PC15L_GMAC_GRX2                     ((PIN_PC15L_GMAC_GRX2 << 16) | MUX_PC15L_GMAC_GRX2)
#define PORT_PC15L_GMAC_GRX2                       (_UL_(1) << 15)

#define PIN_PC14L_GMAC_GRX3                        _UL_(78)    
#define MUX_PC14L_GMAC_GRX3                        _UL_(11)    
#define PINMUX_PC14L_GMAC_GRX3                     ((PIN_PC14L_GMAC_GRX3 << 16) | MUX_PC14L_GMAC_GRX3)
#define PORT_PC14L_GMAC_GRX3                       (_UL_(1) << 14)

#define PIN_PC18L_GMAC_GRXCK                       _UL_(82)    
#define MUX_PC18L_GMAC_GRXCK                       _UL_(11)    
#define PINMUX_PC18L_GMAC_GRXCK                    ((PIN_PC18L_GMAC_GRXCK << 16) | MUX_PC18L_GMAC_GRXCK)
#define PORT_PC18L_GMAC_GRXCK                      (_UL_(1) << 18)

#define PIN_PC20L_GMAC_GRXDV                       _UL_(84)    
#define MUX_PC20L_GMAC_GRXDV                       _UL_(11)    
#define PINMUX_PC20L_GMAC_GRXDV                    ((PIN_PC20L_GMAC_GRXDV << 16) | MUX_PC20L_GMAC_GRXDV)
#define PORT_PC20L_GMAC_GRXDV                      (_UL_(1) << 20)

#define PIN_PA15L_GMAC_GRXER                       _UL_(15)    
#define MUX_PA15L_GMAC_GRXER                       _UL_(11)    
#define PINMUX_PA15L_GMAC_GRXER                    ((PIN_PA15L_GMAC_GRXER << 16) | MUX_PA15L_GMAC_GRXER)
#define PORT_PA15L_GMAC_GRXER                      (_UL_(1) << 15)

