Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.1/include/pio/pic32cx1025sg60100.h
#define PIN_PA19G_TCC0_WO7                         _UL_(19)    
#define MUX_PA19G_TCC0_WO7                         _UL_(6)     
#define PINMUX_PA19G_TCC0_WO7                      ((PIN_PA19G_TCC0_WO7 << 16) | MUX_PA19G_TCC0_WO7)
#define PORT_PA19G_TCC0_WO7                        (_UL_(1) << 19)

#define PIN_PB31G_TCC0_WO7                         _UL_(63)    
#define MUX_PB31G_TCC0_WO7                         _UL_(6)     
#define PINMUX_PB31G_TCC0_WO7                      ((PIN_PB31G_TCC0_WO7 << 16) | MUX_PB31G_TCC0_WO7)
#define PORT_PB31G_TCC0_WO7                        (_UL_(1) << 31)

#define PIN_PA13F_TCC0_WO7                         _UL_(13)    
#define MUX_PA13F_TCC0_WO7                         _UL_(5)     
#define PINMUX_PA13F_TCC0_WO7                      ((PIN_PA13F_TCC0_WO7 << 16) | MUX_PA13F_TCC0_WO7)
#define PORT_PA13F_TCC0_WO7                        (_UL_(1) << 13)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PB10G_TCC1_WO0                         _UL_(42)    
#define MUX_PB10G_TCC1_WO0                         _UL_(6)     
#define PINMUX_PB10G_TCC1_WO0                      ((PIN_PB10G_TCC1_WO0 << 16) | MUX_PB10G_TCC1_WO0)
#define PORT_PB10G_TCC1_WO0                        (_UL_(1) << 10)

#define PIN_PC14G_TCC1_WO0                         _UL_(78)    
#define MUX_PC14G_TCC1_WO0                         _UL_(6)     
#define PINMUX_PC14G_TCC1_WO0                      ((PIN_PC14G_TCC1_WO0 << 16) | MUX_PC14G_TCC1_WO0)
#define PORT_PC14G_TCC1_WO0                        (_UL_(1) << 14)

#define PIN_PA16F_TCC1_WO0                         _UL_(16)    
#define MUX_PA16F_TCC1_WO0                         _UL_(5)     
#define PINMUX_PA16F_TCC1_WO0                      ((PIN_PA16F_TCC1_WO0 << 16) | MUX_PA16F_TCC1_WO0)
#define PORT_PA16F_TCC1_WO0                        (_UL_(1) << 16)

#define PIN_PB18F_TCC1_WO0                         _UL_(50)    
#define MUX_PB18F_TCC1_WO0                         _UL_(5)     
#define PINMUX_PB18F_TCC1_WO0                      ((PIN_PB18F_TCC1_WO0 << 16) | MUX_PB18F_TCC1_WO0)
#define PORT_PB18F_TCC1_WO0                        (_UL_(1) << 18)

#define PIN_PB11G_TCC1_WO1                         _UL_(43)    
#define MUX_PB11G_TCC1_WO1                         _UL_(6)     
#define PINMUX_PB11G_TCC1_WO1                      ((PIN_PB11G_TCC1_WO1 << 16) | MUX_PB11G_TCC1_WO1)
#define PORT_PB11G_TCC1_WO1                        (_UL_(1) << 11)

#define PIN_PC15G_TCC1_WO1                         _UL_(79)    
#define MUX_PC15G_TCC1_WO1                         _UL_(6)     
#define PINMUX_PC15G_TCC1_WO1                      ((PIN_PC15G_TCC1_WO1 << 16) | MUX_PC15G_TCC1_WO1)
#define PORT_PC15G_TCC1_WO1                        (_UL_(1) << 15)

#define PIN_PA17F_TCC1_WO1                         _UL_(17)    
#define MUX_PA17F_TCC1_WO1                         _UL_(5)     
#define PINMUX_PA17F_TCC1_WO1                      ((PIN_PA17F_TCC1_WO1 << 16) | MUX_PA17F_TCC1_WO1)
#define PORT_PA17F_TCC1_WO1                        (_UL_(1) << 17)

#define PIN_PB19F_TCC1_WO1                         _UL_(51)    
#define MUX_PB19F_TCC1_WO1                         _UL_(5)     
#define PINMUX_PB19F_TCC1_WO1                      ((PIN_PB19F_TCC1_WO1 << 16) | MUX_PB19F_TCC1_WO1)
#define PORT_PB19F_TCC1_WO1                        (_UL_(1) << 19)

#define PIN_PA12G_TCC1_WO2                         _UL_(12)    
#define MUX_PA12G_TCC1_WO2                         _UL_(6)     
#define PINMUX_PA12G_TCC1_WO2                      ((PIN_PA12G_TCC1_WO2 << 16) | MUX_PA12G_TCC1_WO2)
#define PORT_PA12G_TCC1_WO2                        (_UL_(1) << 12)

#define PIN_PA14G_TCC1_WO2                         _UL_(14)    
#define MUX_PA14G_TCC1_WO2                         _UL_(6)     
#define PINMUX_PA14G_TCC1_WO2                      ((PIN_PA14G_TCC1_WO2 << 16) | MUX_PA14G_TCC1_WO2)
#define PORT_PA14G_TCC1_WO2                        (_UL_(1) << 14)

#define PIN_PA18F_TCC1_WO2                         _UL_(18)    
#define MUX_PA18F_TCC1_WO2                         _UL_(5)     
#define PINMUX_PA18F_TCC1_WO2                      ((PIN_PA18F_TCC1_WO2 << 16) | MUX_PA18F_TCC1_WO2)
#define PORT_PA18F_TCC1_WO2                        (_UL_(1) << 18)

#define PIN_PB20F_TCC1_WO2                         _UL_(52)    
#define MUX_PB20F_TCC1_WO2                         _UL_(5)     
#define PINMUX_PB20F_TCC1_WO2                      ((PIN_PB20F_TCC1_WO2 << 16) | MUX_PB20F_TCC1_WO2)
#define PORT_PB20F_TCC1_WO2                        (_UL_(1) << 20)

#define PIN_PA13G_TCC1_WO3                         _UL_(13)    
#define MUX_PA13G_TCC1_WO3                         _UL_(6)     
#define PINMUX_PA13G_TCC1_WO3                      ((PIN_PA13G_TCC1_WO3 << 16) | MUX_PA13G_TCC1_WO3)
#define PORT_PA13G_TCC1_WO3                        (_UL_(1) << 13)

#define PIN_PA15G_TCC1_WO3                         _UL_(15)    
#define MUX_PA15G_TCC1_WO3                         _UL_(6)     
#define PINMUX_PA15G_TCC1_WO3                      ((PIN_PA15G_TCC1_WO3 << 16) | MUX_PA15G_TCC1_WO3)
#define PORT_PA15G_TCC1_WO3                        (_UL_(1) << 15)

#define PIN_PA19F_TCC1_WO3                         _UL_(19)    
#define MUX_PA19F_TCC1_WO3                         _UL_(5)     
#define PINMUX_PA19F_TCC1_WO3                      ((PIN_PA19F_TCC1_WO3 << 16) | MUX_PA19F_TCC1_WO3)
#define PORT_PA19F_TCC1_WO3                        (_UL_(1) << 19)

#define PIN_PB21F_TCC1_WO3                         _UL_(53)    
#define MUX_PB21F_TCC1_WO3                         _UL_(5)     
#define PINMUX_PB21F_TCC1_WO3                      ((PIN_PB21F_TCC1_WO3 << 16) | MUX_PB21F_TCC1_WO3)
#define PORT_PB21F_TCC1_WO3                        (_UL_(1) << 21)

#define PIN_PA08G_TCC1_WO4                         _UL_(8)     
#define MUX_PA08G_TCC1_WO4                         _UL_(6)     
#define PINMUX_PA08G_TCC1_WO4                      ((PIN_PA08G_TCC1_WO4 << 16) | MUX_PA08G_TCC1_WO4)
#define PORT_PA08G_TCC1_WO4                        (_UL_(1) << 8)

#define PIN_PC10G_TCC1_WO4                         _UL_(74)    
#define MUX_PC10G_TCC1_WO4                         _UL_(6)     
#define PINMUX_PC10G_TCC1_WO4                      ((PIN_PC10G_TCC1_WO4 << 16) | MUX_PC10G_TCC1_WO4)
#define PORT_PC10G_TCC1_WO4                        (_UL_(1) << 10)

#define PIN_PA20F_TCC1_WO4                         _UL_(20)    
#define MUX_PA20F_TCC1_WO4                         _UL_(5)     
#define PINMUX_PA20F_TCC1_WO4                      ((PIN_PA20F_TCC1_WO4 << 16) | MUX_PA20F_TCC1_WO4)
#define PORT_PA20F_TCC1_WO4                        (_UL_(1) << 20)

#define PIN_PA09G_TCC1_WO5                         _UL_(9)     
#define MUX_PA09G_TCC1_WO5                         _UL_(6)     
#define PINMUX_PA09G_TCC1_WO5                      ((PIN_PA09G_TCC1_WO5 << 16) | MUX_PA09G_TCC1_WO5)
#define PORT_PA09G_TCC1_WO5                        (_UL_(1) << 9)

#define PIN_PC11G_TCC1_WO5                         _UL_(75)    
#define MUX_PC11G_TCC1_WO5                         _UL_(6)     
#define PINMUX_PC11G_TCC1_WO5                      ((PIN_PC11G_TCC1_WO5 << 16) | MUX_PC11G_TCC1_WO5)
#define PORT_PC11G_TCC1_WO5                        (_UL_(1) << 11)

