Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.1/include/pio/pic32cx1025sg60100.h
/* ========== PORT definition for USB peripheral ========== */
#define PIN_PA24H_USB_DM                           _UL_(24)    
#define MUX_PA24H_USB_DM                           _UL_(7)     
#define PINMUX_PA24H_USB_DM                        ((PIN_PA24H_USB_DM << 16) | MUX_PA24H_USB_DM)
#define PORT_PA24H_USB_DM                          (_UL_(1) << 24)

#define PIN_PA25H_USB_DP                           _UL_(25)    
#define MUX_PA25H_USB_DP                           _UL_(7)     
#define PINMUX_PA25H_USB_DP                        ((PIN_PA25H_USB_DP << 16) | MUX_PA25H_USB_DP)
#define PORT_PA25H_USB_DP                          (_UL_(1) << 25)

#define PIN_PA23H_USB_SOF_1KHZ                     _UL_(23)    
#define MUX_PA23H_USB_SOF_1KHZ                     _UL_(7)     
#define PINMUX_PA23H_USB_SOF_1KHZ                  ((PIN_PA23H_USB_SOF_1KHZ << 16) | MUX_PA23H_USB_SOF_1KHZ)
#define PORT_PA23H_USB_SOF_1KHZ                    (_UL_(1) << 23)

#define PIN_PB22H_USB_SOF_1KHZ                     _UL_(54)    
#define MUX_PB22H_USB_SOF_1KHZ                     _UL_(7)     
#define PINMUX_PB22H_USB_SOF_1KHZ                  ((PIN_PB22H_USB_SOF_1KHZ << 16) | MUX_PB22H_USB_SOF_1KHZ)
#define PORT_PB22H_USB_SOF_1KHZ                    (_UL_(1) << 22)

/* ========== PORT definition for TPIU peripheral ========== */
#define PIN_PC27H_TPIU_TRACECLK                    _UL_(91)    
#define MUX_PC27H_TPIU_TRACECLK                    _UL_(7)     
#define PINMUX_PC27H_TPIU_TRACECLK                 ((PIN_PC27H_TPIU_TRACECLK << 16) | MUX_PC27H_TPIU_TRACECLK)
#define PORT_PC27H_TPIU_TRACECLK                   (_UL_(1) << 27)

#define PIN_PC28H_TPIU_TRACED0                     _UL_(92)    
#define MUX_PC28H_TPIU_TRACED0                     _UL_(7)     
#define PINMUX_PC28H_TPIU_TRACED0                  ((PIN_PC28H_TPIU_TRACED0 << 16) | MUX_PC28H_TPIU_TRACED0)
#define PORT_PC28H_TPIU_TRACED0                    (_UL_(1) << 28)

#define PIN_PC26H_TPIU_TRACED1                     _UL_(90)    
#define MUX_PC26H_TPIU_TRACED1                     _UL_(7)     
#define PINMUX_PC26H_TPIU_TRACED1                  ((PIN_PC26H_TPIU_TRACED1 << 16) | MUX_PC26H_TPIU_TRACED1)
#define PORT_PC26H_TPIU_TRACED1                    (_UL_(1) << 26)

#define PIN_PC25H_TPIU_TRACED2                     _UL_(89)    
#define MUX_PC25H_TPIU_TRACED2                     _UL_(7)     
#define PINMUX_PC25H_TPIU_TRACED2                  ((PIN_PC25H_TPIU_TRACED2 << 16) | MUX_PC25H_TPIU_TRACED2)
#define PORT_PC25H_TPIU_TRACED2                    (_UL_(1) << 25)

#define PIN_PC24H_TPIU_TRACED3                     _UL_(88)    
#define MUX_PC24H_TPIU_TRACED3                     _UL_(7)     
#define PINMUX_PC24H_TPIU_TRACED3                  ((PIN_PC24H_TPIU_TRACED3 << 16) | MUX_PC24H_TPIU_TRACED3)
#define PORT_PC24H_TPIU_TRACED3                    (_UL_(1) << 24)



#endif /* _PIC32CX1025SG60100_GPIO_H_ */

